app/controllers/todos_controller.rb

INSERT INTO "todos" ("todo", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["todo", "I need to go to work again"], ["user_id", 4], ["created_at", "2020-04-22 00:17:52.209093"], ["updated_at", "2020-04-22 00:17:52.209093"]]
---
    def create
        id = current_user.id
        @todo = Todo.new(
            user_id: id,
            todo: params[:todo][:todo]
        )
        if @todo.save!